symbol_whitelist = set(x.strip() for x in [
    # Syntax
    "{", "}",
    "[", "]",
    "(", ")",
    "->", "=>", "?", ":",
    ".", ",", ";",
    # Misc
    "?.", "@", "...", "::",
    # Unary
    "++", "--", "~", "!",
    # Number Binary (sorted to match java opcode order)
    "+", "-", "*", "/", "%", "**",
    "<<", ">>", ">>>",
    # Number Binary with boolean support
    "&", "|", "^",
    # Boolean Binary with boolean support
    "&&", "||",
    # nullish_coalescing
    "??",
    # Boolean Binary without boolean support
    "==", "!=", "<", ">=", ">", "<=",
    # Assign
    "=",
    "+=", "-=", "*=", "/=", "%=", "**=",
    "<<=", ">>=", ">>>=",
    "&=", "|=", "^=",
    # Misc? custom
    "<<<",

    # uris
    "://", ":///",
    # javascript
    "===", "!==", "!!",
    # yaml
    "'''",
    # python
    "\"\"\"",
    "__",
    # php
    "<?php","<?=","<?%", "<%",
    "%>","?>",
    ".=",
    # misc
    "[]", "()",
    "[[", "]]", "((", "))",
    "[[[", "]]]", "(((", ")))",

    # Variables & Interpolation
    "${", "#{", "%(", "%{", "{}",
    "{{", "}}", "{{{", "}}}", # 模板引擎如 Handlebars/JinJa2

    # Pipes
    "|>", "<|", "||>", ">>=", "=<<",
    # Haskell / Arrows
    "<-", "->", "=>", ">>=", "::", # 补全
    # C++ Member Pointer
    ".*", "->*",

    # Function call
    "().",
    ".(",
    ").",

    # git
    "<<<<<<<", ">>>>>>>", "=======",

    # 注释
    "//", "/*", "/**", "*/", "///", "//!",
    "<%--", "--%>",

    # Markdown
    "```",
    "---", "===", "***", "___", # 分隔线
    "![", "](", # 超链接
    "( )", "(*)", "[ ]", "[x]",
    "##", "###", "####", "#####", # 标题 (有些Tokenizer会把带空格的标题压成一个ID)
    "|--", "|:", ":|", ":-:", # Markdown 表格相关
    "- [ ]", "- [x]",         # 任务列表

    # 路径与系统
    "../", "./", "../../",
    "~/",
    "\\n", "\\t", "\\r\\n", # 转义字符
    "2>", "&>", "1>", ">>", # Shell 重定向 (>>虽然你在数字区有了，但在Shell语义下也重要)
    " | ", " || ", " && ",   # 带空格的逻辑连接词 (Tokenizer常有这种习惯)

    # Web / XML
    "<![", "]>", # CDATA
    "</", "/>", # 闭合标签
    "<!--", "-->", # 注释
    "<!DOCTYPE",
    "&nbsp;", "&quot;", "&amp;", "&lt;", "&gt;", # HTML 实体

    "..", "..=", ":=", # Rust/Go/Swift
    "::*", "->*", # CSharp
    "<>", # SQL
    "??=", "?:",
    "::>", "<::",
    "!!.",
])
